Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: སྙིང་རྗེ་ཆེན་པོ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐྱབས་སུ་གྱུར་པའི་སྟོབས་དེ་ནི་ཉེ་བར་སྟོན། ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་སྣང་བའི་སྒོ་ནས་ཡང་དག་པར་འབྱུང་བའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དེ་ལ་ནི་རབ་ཏུ་རྟོག །ཆོས་ཀྱི་དབྱིངས་རྒྱ་ཆེན་པོའི་དཀྱིལ་འཁོར་རྒྱས་པར་འགེངས་པའི་སྨོན་ལམ་ཡོངས་སུ་དག་པ་དེའི་རྗེས་སུ་ནི་འབྲང་། ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་སྣང་བར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་འོད་དེ་ནི་ཤིན་ཏུ་གསལ་བར་བྱེད། ཆོས་ཐམས་ཅད་ཀྱིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་རྒྱས་པར་འགེངས་པའི་མངོན་པར་ཤེས་པའི་སྟོབས་དེ་ནི་མངོན་པར་སྒྲུབ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་། དྲན་པ་ཐམས་ཅད་ཉེ་བར་བླངས་པས་བརྩམས་པ་མཐར་དབྱུང་བའི་སྨོན་ལམ་དེ་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་། མཐར་གྱིས་ཡུལ་བགྲོད་དཀའ་བའི་གྲོང་ཁྱེར་རིན་པོ་ཆེའི་རྒྱན་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, with his mind illuminated by that great light of wisdom, focusing upon the light of omniscience, regarding the light of the power of the true nature, strengthening the way of retention that is the treasure of what was known from the voices of all beings, increasing the way of retention that possesses the Dharma wheels of all the tathāgatas, supporting the power of the great compassion that is a refuge for all beings, realizing the strength of the omniscience that comes from the gateway of the light of the way of all Dharmas, following the pure aspiration that pervades the domain of the vast realm of phenomena, shining with the light of wisdom that illuminates all the directions of phenomena, accomplishing the power of the higher knowledge that pervades the array of world realms in the ten directions of all phenomena, and fulfilling the aspirations of accomplishing undertaking all the practices, memories, and actions of the bodhisattvas, eventually arrived at the city of Ratnavyūha in the land of Durga and searched for the courtesan Vasumitrā.

source: བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་དང་། དེ་ལ་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་གྱི་ཡོན་ཏན་མངོན་པར་མི་ཤེས་ལ་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་གྱི་ཚུལ་ལ་མི་མཁས་པའི་མི་ཇི་སྙེད་པ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། མི་འདི་དེ་ལྟར་ཞི་ཞིང་དུལ་བའི་དབང་པོ་དང་ལྡན་ལ་དེ་ལྟར་ཤེས་བཞིན་དང་ལྡན་ཏེ། དེ་ལྟར་འཁྲུལ་པ་མེད་ཅིང་དེ་ལྟར་ཡིད་འཁྲུག་པ་མེད་ལ་དེ་ལྟར་གཉའ་ཤིང་གང་ཙམ་དུ་ལྟ་སྟེ། དེ་ལྟར་གནོད་པས་མི་ཚུགས་ཤིང་དེ་ལྟར་མཚན་མར་མི་འཛིན་ལ། གཟུགས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལ་གཡེང་བ་མེད་པའི་མིག་དང་ལྡན་ཏེ། ཡིད་ལ་བྲེལ་བ་མེད་ཅིང་། བསམ་པ་ཟབ་ལ་མངོན་པར་མཛེས་ཏེ། རྒྱ་མཚོ་ལྟར་འདུག་ཅིང་སེམས་མི་ཉམས་མི་འཁྲུག་པ་དེ་ལ་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མས་ཀོ་ཅི་ཞིག་བྱ།
en: The people there who did not know the qualities of the courtesan Vasumitrā and lacked the knowledge of the scope of wisdom thought, “What does such a man—who has pacified and controlled senses, who is mindful, who is unconfused, whose mind is not agitated, who keeps his gaze the length of a yoke before him, whose mind is not overcome by sensations, who is not fixated on external features , whose eyes are averted from dwelling on any physical form, whose mind is free of preoccupations, who is wise, who is like an ocean, whose mind is unshakable and without weakness—want with the courtesan Vasumitrā?

source: འདི་ལྟ་བུ་དག་ནི་འདོད་ཆགས་ལ་དགའ་བ་མེད་དེ། སེམས་ཕྱིན་ཅི་ལོག་དང་ལྡན་ཡང་མི་སྲིད་དོ།
en: Someone like this does not delight in sensual pleasures, and so his mind cannot possibly go astray.

source: །འདི་ལྟ་བུ་དག་ནི་སྡུག་ཅིང་གཙང་བའི་འདུ་ཤེས་ཡོངས་སུ་རྒྱུ་བ་མེད་དེ།
en: Someone like this does not engage in impure thoughts.

source: འདི་ལྟ་བུ་དག་ནི་འདོད་པས་འཁོལ་ཀྱང་མི་སྲིད་དོ།
en: It is not possible that someone like this would be a slave to desire.

source: །འདི་ལྟ་བུ་དག་ནི་བུད་མེད་ཀྱི་དབང་དུ་འགྱུར་བ་མེད་དེ།
en: Someone like this does not fall under the power of a woman.

source: འདི་ལྟ་བུ་དག་ནི་བདུད་ཀྱི་སྤྱོད་ཡུལ་ལ་སྤྱོད་ཀྱང་མི་སྲིད་དོ།
en: It is not possible that someone like this is engaged in the field of conduct of the māras.

source: །འདི་ལྟ་བུ་དག་ནི་བདུད་ཀྱི་སྤྱོད་ཡུལ་ལ་ཆགས་པ་མེད་དེ།
en: Someone like this does not dwell in the field of conduct of the māras.

source: འདི་ལྟ་བུ་དག་ནི་འདོད་པའི་འདམ་དུ་བྱིང་བ་ཡང་མི་སྲིད་དོ།
en: It is not possible that someone like this is sinking into the mud of desire.

source: །འདི་ལྟ་བུ་དག་ནི་བདུད་ཀྱི་ཞགས་པས་བཅིངས་པར་འགྱུར་བ་མེད་དེ།
en: Someone like this is not bound by the noose of the māras.

source: མི་དགོས་པ་བྱེད་ཀྱང་མི་སྲིད་དོ་སྙམ་མོ།
en: He is not someone who would do what should not be done.”

source: །གང་ཡང་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་ཡོན་ཏན་གྱི་ཁྱད་པར་མངོན་པར་ཤེས་ཤིང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་མངོན་དུ་གྱུར་པ་དེ་དག་ནི་འདི་སྐད་ཅེས་འཛེར་ཏེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ལ་ཡོངས་སུ་དྲི་བར་སེམས་པ་ནི་ཁྱོད་ཀྱང་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་པ་སྟེ།
en: Those who did know the special qualities of the courtesan Vasumitrā and directly perceived wisdom’s range of conduct said to him, “It is excellent, excellent, noble one, that you intend to ask questions of the courtesan Vasumitrā;

source: ལེགས་སོ་ལེགས་སོ།
en: you have perfectly obtained a good outcome.

source: །ཁྱོད་ནི་ངེས་པར་སངས་རྒྱས་སུ་སྨོན་པའོ།
en: You are certainly aspiring to buddhahood.

source: །ཁྱོད་ནི་བདག་ངེས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་བསྒྱུར་བར་འདོད་པའོ།
en: You are certainly wishing to become a refuge for all beings.

source: །ཁྱོད་ནི་ངེས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་ཀྱི་ཟུག་རྔུ་དབྱུང་བར་འདོད་པའོ།
en: You are certainly wishing to remove from all beings the pain of desire.

source: །ཁྱོད་ནི་ངེས་པར་སྡུག་ཅིང་གཙང་བའི་འདུ་ཤེས་རྣམ་པར་གཏོར་བར་འདོད་པའོ།
en: You are certainly wishing to dispel conceptions of beauty and purity.

source: །རིགས་ཀྱི་བུ་འདེ་རེ་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ནི་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་བྱང་ཕྱོགས་ལོགས་ཤིག་ན་རང་གི་ཁྱིམ་ན་འདུག་གོ །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚིག་དེ་ཐོས་ནས་དགའ་རངས་ཏེ།
en: “Noble one, the courtesan Vasumitrā is in her home, which is on the north side of the city’s junction of three streets.”

source: མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Sudhana, the head merchant’s son, on hearing those words, was filled with joy, delighted, elated, pleased, and happy.

source: བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་ཁྱིམ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: He went to the home of the courtesan Vasumitrā.

source: དེའི་ཁྱིམ་ཆེ་ཞིང་ཡངས་ལ་རིན་པོ་ཆེའི་ར་བ་རིམ་པ་བཅུས་བསྐོར་བ།
en: He saw that her house was huge and vast and surrounded by ten successive precious walls.

source: རིན་པོ་ཆེ་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བཅུས་ཀུན་ནས་བསྐོར་བ། འོབས་སྤོས་ཆུས་གང་བ།
en: It was encircled by ten successive rows of precious palm trees.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་པད་མོ་དང་། ཨུཏ་པ་ལ་དང་། ཀུ་མུ་ཏ་དང་། མེ་ཏོག་པུན་ད་རི་ཀས་ཆུ་ཡོངས་སུ་ཁེབས་པ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་བ།
en: It was encircled by ten successive moats filled with water and covered with divine, precious red lotuses, blue lotuses, night lotuses, and white lotuses; they were filled with water that possessed the eight good qualities;

source: གཞི་གསེར་གྱི་བྱེ་མ་བདལ་བ།
en: they had bottoms that were covered with gold dust;

source: སྤོས་ཡིད་དུ་འོང་བ་དང་། འདྲེས་པའི་ཆུདྲི་ཞིམ་པས་གང་བ།
en: they were filled with aromatic water mixed with beautiful scents;

source: རིན་པོ་ཆེ་སིལ་མ་མང་པོས་ཤིན་ཏུ་བརྒྱན་པ།
en: and they were adorned by numerous precious fences.

source: རིམ་པ་བཅུས་ཀུན་ནས་བསྐོར་བ། རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པས་རྣམ་པར་དགྲིགས་ཤིང་བ་གམ་དང་རྟ་བབས་དང་། སྐར་ཁུང་གི་ཤར་བུ་དང་། ཟླ་གམ་སེང་གེའི་ཤིང་ཏགས་དང་། སྣང་བའི་རྒྱལ་མཚན་ལ་སྩོགས་པ།
en: He saw well-arranged buildings, palaces, kūṭāgāras made from every jewel with high pinnacles, toraṇas, round windows, lattices, crescents, pavilions, shining banners, and so on, brilliant with various jewels.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འོད་ཀྱིས་འབར་བ་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་གྲངས་མེད་པའི་འབྱུང་གནས་ཀྱིས་བརྒྱན་པ།
en: Her house was beautified by walls of countless various jewels.

source: རིན་པོ་ཆེའི་དག་བཻཌཱུཪྻས་སྦས་པའི་གཞི་དང་ལྡན་པ།
en: Its floor was formed of jewels inlaid with beryls.

source: ལྷ་རྫས་ཀྱི་སྤོས་ཞིམ་པོ་ཐམས་ཅད་ཀྱིས་འཁོར་ཐམས་ཅད་ནས་བདུགས་ཤིང་བསངས་པ།
en: Its environs were perfumed by every aromatic divine incense.

source: ཨ་ཀ་རུ་ནག་པོ་མཆོག་གི་བདུག་སྤོས་ཀྱིས་དྲི་ཞིམ་པར་བདུག་པ།
en: It was perfumed by the aroma of supreme black agarwood incense.

source: སྤོས་ཀྱི་བྱུག་པས་འཁོར་ཀུན་ནས་བྱུགས་པ།
en: Its environs were anointed with unguents.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལན་ཀན་གྱིས་རྩིག་ངོས་ཀུན་ཏུ་བྲེས་པ།
en: Rooftop railings made of various jewels adorned the walls.

source: སྟེང་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་དྲ་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་སྤྲས་པས་ཀུན་ནས་བཀབ་པ།
en: It was covered above by nets of Jambu River gold inlaid with various jewels.

source: གསེར་གྱི་དྲིལ་གྱི་དྲ་བ་བརྒྱ་སྟོང་རླུང་གིས་བསྐྱོད་ཅིང་འཁྲོལ་བའི་སྒྲ་ཡིད་དུ་འོང་ཞིང་སྙན་པ་འབྱུང་བ།
en: A hundred thousand networks of hundreds of golden bells were ringing as they were moved by the breeze, emitting a pleasant, beautiful sound.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གི་སྤྲིན་སིལ་མ་ཀུན་ཏུ་བཀྲམ་པས། རིན་པོ་ཆེའི་མེ་ཏོག་གི་རྒྱན་དང་ལྡན་པ།
en: It was adorned by precious flowers scattered and dispersed from clouds of flowers made from every jewel.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བས་སྒོ་ཤིན་ཏུ་བརྒྱན་པ།
en: The gateways were adorned by erected multicolored banners made of all precious materials.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འོད་ཀྱི་དྲ་བ་སྣང་བ། མུ་མེད་པར་བརྗོད་དུ་ཡོད་པ།
en: The light from the brilliant shining of various precious jewels shone outward without limit.

source: རིན་པོ་ཆེ་བྱུ་རུའི་སྡོང་པོ་དང་། རྡོ་རྗེ་དང་། མན་ཤེལ་ལ་སྩོགས་པའི་གཏེར་བརྒྱ་སྟོང་ཀུན་གྱིས་ཤེས་པ། ཕུན་སུམ་ཚོགས་པས་མཛོད་མི་ཟད་པ་དང་ལྡན་པ། བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་བཅུས་བརྒྱན་པ་མཐོང་སྟེ།
en: There was an endless treasure of a perfect multitude of hundreds of thousands of precious trees of coral, diamonds, crystal, and so on, and it was beautified by ten parks.

source: དེ་ནས་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་གཟུགས་མཛེས་ཤིང་བཟང་ལ་བལྟ་ན་སྡུག་པ།
en: Sudhana saw there the courtesan Vasumitrā, who was beautiful, attractive, and delightful to see.

source: གྱ་ནོམ་པའི་ཁ་དོག་དམ་པ་རྒྱས་པ་དང་ལྡན་པ།
en: She was endowed with a magnificent, perfect color.

source: གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པའི་མདོག་ཅན་སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ།
en: She had golden skin and deep black hair.

source: ལུས་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་ཚུལ་དང་འདྲ་བར་རྣམ་པར་གྲུབ་པ།
en: Her limbs and smaller features were all perfectly formed.

source: འདོད་པའི་ཁམས་ཀྱི་ལྷ་དང་མི་ཐམས་ཅད་ལས་འཕགས་པའི་ཁ་དོག་དང་གཟུགས་དང་དབྱིབས་མཛེས་པ་དང་ལྡན་པ།
en: She had a beautiful color, form, and shape that were superior to those of all humans and devas of the desire realm.

source: ཚངས་པ་ལས་ཀྱང་འདས་པའི་དབྱངས་ཀྱི་ཡན་ལག་དང་ལྡན་པ།
en: The aspects of her voice were superior to those of Brahmā.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་ཀྱི་ཚུལ་ལ་མཁས་པ།
en: She was skilled in the languages of all beings.

source: རྒྱན་ཐམས་ཅད་དང་ལྡན་ཞིང་ཡིད་དུ་འོང་བའི་དབྱངས་ཅན་རྣམ་པར་ཐར་པ་ཡི་གེའི་འཁོར་ལོའི་རྒྱན་ལ་མཁས་པ་དང་ལྡན་པ།
en: She had a beautiful voice that had the array of all sounds. She possessed the skill of the liberation called the array of the wheel of words

source: བཟོ་དང་གཙུག་ལག་ཐམས་ཅད་ལ་མཁས་པར་བྱུང་བ།
en: She had become skilled in all arts and treatises.

source: ཆོས་ཀྱི་ཡེ་ཤེས་སྒྱུ་མ་ལ་མཁས་པར་བསླབས་པ།
en: She had trained to become wise in illusions through Dharma wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐབས་དང་ཚུལ་རྣམ་པ་ཐམས་ཅད་དུ་ཐོབ་པ།
en: She had attained all the methods and ways of the bodhisattvas.

source: རིན་པོ་ཆེའི་ལྷབ་ལྷུབ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྒྱན་པའི་ལུས་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: She had a beautiful body adorned by various kinds of precious jewelry.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་དྲ་བ་འོད་ཤིན་ཏུ་གསལ་བས་ལུས་རབ་ཏུ་བརྒྱན་པ།
en: Her body was adorned by a brightly shining network of all jewels.

source: ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་དང་། ལྷབ་ལྷུབ་གྲངས་མེད་པས་རབ་ཏུ་བརྒྱན་པས། ལུས་ཤིན་ཏུ་འབར་བ།
en: Her body shone brightly, being adorned by an array of jewelry made of countless divine precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ཅོད་པན་ཐོགས་པ།
en: She wore tied upon her head a king of wish-fulfilling, supreme, precious jewels.

source: རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་ཕྲེང་བ་མདོ་ཟུངས་རྡོ་རྗེ་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། ནོར་བུ་རིན་པོ་ཆེ་སེང་གེ་མཛེས་པ་སྣ་ཚོགས་བཀྱེ་བ་མགུལ་ན་ཐོགས་པ།
en: She wore at her throat a string of beryl jewels with its middle adorned by diamonds, a multicolored beautiful lion, and precious jewels.

source: དགེ་བའི་རྩ་བ་སྤྱད་པ་ལ་སྐལ་བ་འཐུན་པ་དང་། སྨོན་ལམ་གཅིག་པའི་འཁོར་མང་པོ་གཞན་གྱིས་མི་ཕྱེད་ཅིང་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: She had a beautiful assembly of followers that could not be divided, that had a single aspiration and a similar share of the practice of the roots of merit.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོའི་གཏེར་མི་ཟད་པའི་མཛོད་དང་ལྡན་པ་འདུག་པ་མཐོང་སྟེ།
en: She possessed an inexhaustible treasury of the treasure of the great accumulations of merit and wisdom.

source: དེས་ཁྱིམ་དེ་དག་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་གནས་དང་། གཞལ་མེད་ཁང་གི་རྒྱན་དེ་དག་ཐམས་ཅད་ཀྱང་རང་གི་ལུས་ལས་བྱུང་བའི་འོད་དགའ་བར་བྱེད་པ། ལུས་བདེ་བ་དང་སིམ་པ་སྐྱེད་པ། སེམས་ཁོང་ནས་དགའ་བར་བྱེད་པས་གསལ་ཞིང་སྣང་བར་བྱས་པ་མཐོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana saw that all those buildings, the entire array of precious dwellings and palaces, were illuminated and made bright by the light that came from her body, which caused delight, physical pleasure and bliss, and joy and happiness in the mind.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the courtesan Vasumitrā, stood before her with hands placed together in homage, and said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་མས་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: །དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པ་ཞེས་བྱ་བ་ཐོབ་སྟེ།
en: Vasumitrā said, “Noble one, I have attained the bodhisattva liberation called the complete attainment of freedom from desire

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་ལྷ་རྣམས་ལ་ལྷ་མོའི་གཟུགས་དང་ཁ་དོག་དང་། དབྱིབས་དང་ཆུ་ཞེང་ལས་ཀྱང་ལྷག་པར་ཁ་དོག་གསལ་བ་དང་། རྣམ་པར་དག་པས་ཅི་ལ་མོས་པ་བཞིན་དུ་སྣང་བར་བྱེད་དོ།
en: “Noble one, in this way I appear to the devas in accordance with their wishes in the form, color, shape, and size of an apsaras with a brighter and purer color.

source: །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ལ་ཡང་བུད་མེད་ཀྱི་གཟུགས་དང་། ཁ་དོག་དང་དབྱིབས་དང་། ཆུ་ཞེང་ལྷག་པར་འོད་གསལ་ཞིང་རྣམ་པར་དག་པས་ཅི་ལ་མོས་པ་བཞིན་དུ་སྣང་བར་བྱེད་དོ།
en: In the same way, I appear in accordance with their wishes in a female form, color, shape, and size with a brighter and purer color to the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans.

source: །སེམས་ཅན་གང་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་འཁོར་བའི་སེམས་དང་ལྡན་པ་དག །ཁོ་མོའི་དྲུང་དུ་འོང་ནའང་དེ་དག་ཐམས་ཅད་ལ་ཁོ་མོ་ནི་འདོད་ཆགས་དང་འབྲལ་བར་འགྱུར་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: “When beings whose minds are encircled by desire come before me, I teach all of them the Dharma so that they will become free from desire.

source: དེ་དག་གིས་ཆོས་དེ་ཐོས་ནས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་རོ།
en: When they hear the Dharma, they attain freedom from desire.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆགས་པ་མེད་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་ཁོ་མོ་མཐོང་མ་ཐག་ཏུ་འདོད་ཆགས་དང་བྲལ་བར་འགྱུར་ཏེ།
en: They attain the bodhisattva samādhi called the realmof nonattachment.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དགའ་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་གཏམ་བྱས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire the instant they see me, and they attain the bodhisattva samādhi called joyfulness

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆགས་པ་མེད་པའི་དབྱངས་ཤེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་ལག་ནས་བཟུང་བ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྗེས་སུ་འགྲོ་ཞིང་གནས་པ་ཞེས་བྱ་བའང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་གཅིག་ཏུ་འགྲོགས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire when they hold my hand, and they attain the bodhisattva samādhi called going to and residing in all the buddha realms

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྲལ་བས་སྣང་བ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་བལྟས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire when they are alone in my company, and they attain the bodhisattva samādhi called the light of detachment

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཞི་བའི་རྣམ་པར་བརྒྱན་ཅེས་བྱ་བ་ཡང་རབ་ཏུ་ཐོབ་བོ། །ལ་ལ་ནི་གླེལ་བ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire just by gazing upon me, and they attain the bodhisattva samādhi called the display of the form of peace

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཕས་ཀྱི་རྒོལ་བ་རྣམ་པར་འཐོར་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་མྱིག་བཙུམས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire just by yawning, and they attain the bodhisattva samādhi called the disarraying of adversaries

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཡུལ་སྣང་བ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་པང་དུ་འཁྱུད་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་འཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire just by closing their eyes, and they attain the bodhisattva samādhi called the light of the buddha domains

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྡུར་ཅིང་མྱི་གཏོང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་འོ་བྱས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་འཐོབ་པར་འགྱུར་ཏེ།
en: Some become free from desire just by embracing me, and they attain the bodhisattva samādhi called the essence of gathering and not abandoning all beings

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འགྲོ་བ་ཐམས་ཅད་བསོད་ནམས་ཀྱི་མཛོད་ལ་རེག་པར་བྱེད་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ།
en: Some become free from desire just by kissing me, and they attain the bodhisattva samādhi called touching the treasure of the merit of all beings

source: །དེ་ལྟར་ཁོ་མོ་ནི་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཁོ་མོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པའི་ས་ཆགས་པ་མེད་པ་ལ་མངོན་དུ་གྱུར་པ་འདི་ཉིད་ལ་རབ་ཏུ་འགོད་དོ། །སྨྲས་པ།
en: In that way, I establish all the beings who come to me in the bodhisattva liberation called the complete attainment of freedom from desire and the manifestation of the attachment-free level of omniscience

source: འཕགས་མ་ཁྱོད་དེ་ལྟ་བུའི་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་དེ་ཁྱོད་ཀྱིས་དགེ་བའི་རྩ་བ་ནི་གང་དུ་བསྐྱེད།
en: Sudhana asked, “Āryā, what roots of merit did you develop?

source: ཕྲིན་ལས་ནི་ཇི་ལྟ་བུ་ཞིག་བསྩགས།
en: What kinds of activities did you accumulate so that you have attained this kind of perfection?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་མོས་དྲན་ན་འདས་པའི་དུས་ཤིག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤིན་ཏུ་མཐོ་བར་གཤེགས་པ་ཞེས་བ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Vasumitrā replied, “Noble one, I remember that in a past time, there had appeared in the world a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat named Atyuccagāmin.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོ་བར་གཤེགས་པ་དེ་སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བའི་སྐུ་དོན་ཏུ་རྒྱལ་པོའི་གནས་སྒོ་བཟང་པོ་ཞེས་བྱ་བར་གཤེགས་ནས་སྒོའི་ཐེམ་པ་ལ་ཞབས་ཀྱིས་གནོན་པའི་ཚེ།
en: “The Tathāgata Atyuccagāmin, because of his love for beings, went to the capital city named Sumukhā.

source: གྲོང་ཁྱེར་དེ་ཐམས་ཅད་ཀྱང་། རབ་ཏུ་གཡོས་ནས་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་རིན་པོ་ཆེ་དུ་མ་ལས་བྱས་པར་ཡོངས་སུ་གྲུབ་པར་གྱུར་ཏེ།
en: When he placed his foot upon the threshold of its gateway, the entire city shook and became huge, vast, and made of many jewels.

source: སྟེང་གི་བར་སྣང་ཡང་རིན་པོ་ཆེ་མང་པོའི་འོད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོ་སྣ་ཚོགས་ཀྱི་སྒྲ་རབ་ཏུ་འབྱུང་བ་དང་། ལྷའི་ལུས་ཀྱི་སྤྲིན་ཚད་མེད་པ་རྒྱ་ཆེ་བས་ཁེབས་པར་གྱུར་ཏོ།
en: In the sky above, there was the light of a display of many jewels; it was filled with various precious flowers, emitted the sound of various divine musical instruments, and was pervaded by vast, measureless clouds of deva bodies.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ཡང་དེའི་ཚེ་ཚོང་དཔོན་གྱི་ཆུང་མ་ཞིག་ཏུ་གྱུར་ཏེ། བློ་གྲོས་བཟང་མོ་ཞེས་བྱའོ།
en: “Noble one, at that time, I was the wife of a head merchant, and my name was Sumati.

source: །དེ་ནས་ཁོ་མོ་ཆོ་འཕྲུལ་གྱིས་ཡང་དག་པར་བསྐུལ་ནས་ཁྱིམ་ཐབ་དང་ལྷན་ཅིག་ཏུ་དོང་དོང་སྟེ། དེ་བཞིན་གཤེགས་པ་གྲོང་བར་གྱི་སྲང་དུ་གཤེགས་པ་ལ་དད་པ་རྒྱ་ཆེན་པོ་སྐྱེས་ཏེ།
en: Inspired by the miracles of the Buddha, my spouse and I ran and came to the Tathāgata in a street in the middle of the city.

source: ཁོ་མོས་ནི་རིན་པོ་ཆེའི་དྲིལ་བུ་གཅིག་ཅིག་ཕུལ་ལོ།
en: Developing a fast faith, I offered to him one precious bell.

source: །དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོ་བར་གཤེགས་པའི་ཞམ་འབྲིང་ན་འདུག་ཏེ།
en: “At that time, Mañjuśrī Kumāra­bhūta was an attendant of the Bhagavat, the Tathāgata Atyuccagāmin.

source: དེས་ཁོ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Through him I developed the aspiration to the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the complete attainment of freedom from desire

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་དང་ཡེ་ཤེས་མཐའ་ཡས་པ་ལ་གནས་པ། བསོད་ནམས་རྒྱ་ཆེ་ཞིང་ཡངས་པའི་མཛོད་དང་ལྡན་པ། ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་ཐུབ་པ་མེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of those bodhisattvas who dwell in infinite method and wisdom, who have a vast, immense treasure of merit, and who are invincible in their scope of wisdom? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བ་བ་ཡོད་དེ།
en: In this southern region there is a city called Śubhapāraṃgama.

source: དེ་ན་ཁྱིམ་བདག་ནན་ཁུགས་ཤེས་བྱ་བ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཙན་དན་གྱི་ཁྲི་འཕང་ཅན་ལ་མཆོད་པ་བྱེད་པ་ཞིག་འདུག་གིས།
en: There dwells a householder by the name of Veṣṭhila who makes offerings to a sandalwood chair that is a tathāgata shrine.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the courtesan Vasumitrā, circumambulated the courtesan Vasumitrā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the courtesan Vasumitrā.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་གྲོང་ཁྱེར་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་ཁྱིམ་ག་ལ་བ་དེར་ཕྱིན་ནས། ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Veṣṭhila Then Sudhana went to the town of Śubhapāraṃgama and approached the householder Veṣṭhila.
